{
  "backend/main.mo": "Motoko canister implementing a contact request backend with persistent storage, topic-based requests, validation, and admin-only query/update operations using an access control mixin.",
  "feature_evidence.json": "Feature evidence report documenting a change to revert the hero section background image, listing affected files, components, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files, components, hooks, configuration, styles, and documentation for the anime website application.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, color variables, typography, and base styles for the site.",
  "frontend/index.html": "HTML entry point defining the document metadata, page title, root div, and loading the React application module.",
  "frontend/RUN-LOCAL-AND-DEPLOY-IC.md": "Step-by-step guide for running the project locally and deploying it to the Internet Computer, including prerequisites, commands, and troubleshooting.",
  "frontend/src/App.tsx": "Root React component that sets up React Query, global layout, navigation, all site sections, admin dashboard, footer, and toast notifications.",
  "frontend/src/components/AboutSection.tsx": "About section component rendering the series synopsis from configuration with consistent section header styling.",
  "frontend/src/components/AdminSection.tsx": "Admin dashboard component handling Internet Identity authentication, fetching and managing contact requests, status toggling, and JSON export with UI feedback.",
  "frontend/src/components/CharactersSection.tsx": "Characters section displaying a responsive grid of character cards populated from configuration with detailed stats and descriptions.",
  "frontend/src/components/ContactSection.tsx": "Implements a contact form with email, topic, and message fields, including client-side validation and submission via a React Query mutation. Displays success/error toasts and disables inputs while submitting.",
  "frontend/src/components/EpisodesSection.tsx": "Renders a list of anime episodes from configuration data, displaying episode number, title, and synopsis in styled cards.",
  "frontend/src/components/Footer.tsx": "Displays a site footer with copyright text and social media links to Twitter (X) and GitHub using icon components.",
  "frontend/src/components/GalleryLightbox.tsx": "Empty or placeholder file intended for a gallery lightbox component; no implementation present.",
  "frontend/src/components/GallerySection.tsx": "Empty or placeholder file intended for a gallery section component; no implementation present.",
  "frontend/src/components/HeroSection.tsx": "Renders the full-screen hero section with background image, title, tagline, CTA buttons, and smooth scrolling to other sections.",
  "frontend/src/components/SectionHeader.tsx": "Reusable header component that displays a section title with centered styling and an accent underline.",
  "frontend/src/components/TopNav.tsx": "Implements a fixed responsive top navigation bar with smooth scrolling, scroll-based styling changes, and a mobile menu toggle.",
  "frontend/src/components/WorldbuildingSection.tsx": "Displays detailed worldbuilding content such as clans, power rules, rank system, and family lore using data from site configuration.",
  "frontend/src/content/animeSiteConfig.ts": "Central configuration file containing site text, CTA labels, worldbuilding lore, and character data for the anime website.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches a backend actor based on authentication state, handling identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context, provider, and hook for authenticating users via DFINITY Internet Identity, managing login state, identity persistence, and logout. Wraps AuthClient creation with app-specific defaults and exposes status flags and helpers to consumers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting contact requests, fetching all requests, and updating request status via a backend actor. Automatically invalidates the contactRequests query after successful mutations.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining light and dark OKLCH design tokens, typography, base styles, and UI theming. Includes custom fonts, scroll behavior, and scrollbar styling for an anime/manga-inspired look.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, wrapping it with React Query and Internet Identity providers. Imports global styles and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters from query strings or hash routes and persisting them in sessionStorage. Includes functions to retrieve, store, clear, and sanitize parameters without reloading the page.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling class-based dark mode, OKLCH color tokens, custom radii, shadows, animations, and fonts. Registers typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, features, and architecture, including frontend theming, content sections, ICP backend integration, and admin dashboard capabilities. Used for planning, tracking, and versioning project features."
}