{
  "backend/main.mo": "Defines an empty Internet Computer actor with no methods or state implemented.",
  "feature_evidence.json": "Machine-readable report listing implemented features, their IDs, confidence levels, related components, tests, and affected files.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all frontend source files and their roles within the anime website.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, colors, typography, and base styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and sets the document title to \"Whispers of the White Moon\".",
  "frontend/RUN-LOCAL-AND-DEPLOY-IC.md": "Step-by-step guide for installing prerequisites, running the frontend locally, and deploying it to the Internet Computer.",
  "frontend/src/App.tsx": "Root React component that assembles navigation, all content sections, and the footer into a single-page layout.",
  "frontend/src/components/AboutSection.tsx": "Renders the About section using a shared header and synopsis text from the central site configuration.",
  "frontend/src/components/CharactersSection.tsx": "Displays a responsive grid of character cards populated from configuration data with stats, bios, and styling.",
  "frontend/src/components/ContactSection.tsx": "Non-functional contact form UI marked as coming soon, with disabled inputs and placeholder state handling.",
  "frontend/src/components/EpisodesSection.tsx": "Lists episodes from configuration with episode numbers, titles, synopses, and accent-based styling.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice, caffeine.ai attribution, heart icon, and social media links.",
  "frontend/src/components/GalleryLightbox.tsx": "Empty placeholder file intended for a full-screen gallery lightbox implementation.",
  "frontend/src/components/GallerySection.tsx": "Empty placeholder file intended for a responsive image gallery section.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section using a generated moon/waterfall and volcano/sun background image, title, tagline, CTAs, and smooth-scroll behavior.",
  "frontend/src/components/SectionHeader.tsx": "Reusable section header component that renders a styled title with an accent underline.",
  "frontend/src/components/TopNav.tsx": "Implements a fixed top navigation bar with smooth scrolling to page sections, responsive desktop/mobile menus, and scroll-based styling changes. Uses site config for the logo title and lucide-react icons for the mobile toggle.",
  "frontend/src/components/WorldbuildingSection.tsx": "Renders the Worldbuilding section of the site, displaying clans, clan eye rules, power system, rank system, and family lore. All content is driven by the worldbuilding data in animeSiteConfig and styled with reusable card layouts.",
  "frontend/src/content/animeSiteConfig.ts": "Central configuration file containing all narrative content for the site, including title, synopsis, worldbuilding details, and character data. Acts as the single source of truth for frontend-rendered story content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor using React Query, switching between anonymous and authenticated actors based on Internet Identity. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including login, logout, and status tracking. Wraps AuthClient setup, identity persistence, and exposes state helpers to the app.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend query hooks are needed because all data is frontend-config driven.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining a manga-inspired light and dark theme, typography, color variables, and UI utilities. Includes custom scrollbar styling and smooth scrolling behavior.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, sets up React Query, and wraps the app with the InternetIdentityProvider. Imports global styles and renders into the root DOM node.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, scanning frontend content files, and extending the theme with OKLCH color tokens, custom container sizing, fonts, shadows, radii, and accordion animations. It also registers typography, container-queries, and animation plugins.",
  "project_state.json": "Project metadata and snapshot describing the overall architecture, features, and current state of the repository, including a React + TypeScript SPA frontend, Tailwind design system, and an empty ICP Motoko backend scaffold. It enumerates existing features and versions to track project evolution and removed components."
}