{
  "backend/main.mo": "Motoko canister implementing a contact request backend with topic-based submissions, validation, persistent storage, and admin-only query/update APIs secured via access control.",
  "feature_evidence.json": "Machine-readable report documenting two completed frontend features related to removing a character age value and conditionally rendering age metadata, including affected files and test IDs.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend files and components, describing layout, UI sections, hooks, configuration, and deployment docs.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark theme variables, manga-inspired OKLCH color tokens, base styles, and typography defaults.",
  "frontend/index.html": "Minimal HTML entry point that sets the document title and mounts the React application at the root element.",
  "frontend/RUN-LOCAL-AND-DEPLOY-IC.md": "Step-by-step guide for running the site locally and deploying it to the Internet Computer, covering prerequisites, commands, and troubleshooting.",
  "frontend/src/App.tsx": "Root React component that configures React Query and renders all major site sections, navigation, footer, and toast notifications.",
  "frontend/src/components/AboutSection.tsx": "Section component that displays the anime synopsis from configuration using a shared section header and styled prose layout.",
  "frontend/src/components/AdminSection.tsx": "Admin dashboard UI handling Internet Identity authentication, viewing/exporting contact requests, and toggling request status via backend APIs.",
  "frontend/src/components/CharactersSection.tsx": "Characters grid component that renders character cards from config with conditionally assembled metadata, including optional age display.",
  "frontend/src/components/ContactSection.tsx": "Implements a contact form with email, topic, and message fields, including client-side validation and submission via a React Query mutation. Shows success/error toasts and disables inputs while submitting.",
  "frontend/src/components/EpisodesSection.tsx": "Renders a list of anime episodes from animeSiteConfig with episode numbers, titles, and synopses in a styled section.",
  "frontend/src/components/Footer.tsx": "Displays a site footer with copyright year and social media links to Twitter and GitHub using icons.",
  "frontend/src/components/GalleryLightbox.tsx": "Empty component file; no implementation present.",
  "frontend/src/components/GallerySection.tsx": "Empty component file; no implementation present.",
  "frontend/src/components/HeroSection.tsx": "Renders the hero banner with background image, title, tagline, CTA buttons, and smooth scrolling to page sections. Includes a scroll indicator icon.",
  "frontend/src/components/SectionHeader.tsx": "Reusable section header component that displays a styled title with an accent underline.",
  "frontend/src/components/TopNav.tsx": "Implements a fixed top navigation bar with scroll-aware styling, smooth scrolling links, and a responsive mobile menu. Navigation labels and logo come from animeSiteConfig.",
  "frontend/src/components/WorldbuildingSection.tsx": "Displays structured worldbuilding content such as clans, clan eye rules, power system, rank system, and family lore sourced from animeSiteConfig.",
  "frontend/src/content/animeSiteConfig.ts": "Central configuration object containing site metadata, CTA labels, worldbuilding lore, characters, and episode/story data for the anime site.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches a backend actor using React Query, handling authenticated vs anonymous identities. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context, provider, and hook for Internet Identity authentication using DFINITY AuthClient, managing identity state, login/logout actions, and detailed login status flags across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting, fetching, and updating contact requests via an ICP actor, with automatic cache invalidation on successful mutations.",
  "frontend/src/index.css": "Sets up global Tailwind CSS styles, OKLCH-based light/dark theme tokens, custom fonts, typography rules, smooth scrolling, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React application by creating the root, initializing a React Query client, and wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions to read URL parameters from query strings or hash routing, persist them in sessionStorage, and safely clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode support, content paths, extended OKLCH color tokens, typography, animations, container settings, and additional plugins.",
  "project_state.json": "Describes the overall project state, feature inventory, and high-level summary of an anime-themed React + TypeScript site with Tailwind styling, ICP backend integration, and Internet Identity–secured admin features."
}