{
  "backend/main.mo": "Motoko canister handling user profiles, access control, and contact request submission and admin retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Plaintext summaries of all major frontend files and components.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, theming, and base styling.",
  "frontend/index.html": "HTML entry point setting page title and mounting the React app.",
  "frontend/RUN-LOCAL-AND-DEPLOY-IC.md": "Guide for running the project locally and deploying it to the Internet Computer.",
  "frontend/src/App.tsx": "Main React app composing all sections, navigation, and query client setup.",
  "frontend/src/components/AboutSection.tsx": "Renders the About section using site synopsis content.",
  "frontend/src/components/AdminSection.tsx": "Admin interface for authentication, managing contact requests, and granting admin roles.",
  "frontend/src/components/CharactersSection.tsx": "Renders a characters grid using animeSiteConfig, conditionally showing images, metadata, bios, and extra fields.",
  "frontend/src/components/ClansSection.tsx": "Defines clan data and displays a grid of clan cards with sigils and descriptions.",
  "frontend/src/components/ContactSection.tsx": "Implements a contact form with validation, topic selection, mutation submission, and success/error toasts.",
  "frontend/src/components/EpisodesSection.tsx": "Lists episodes from config and triggers episode selection with scroll-to-video behavior on click.",
  "frontend/src/components/Footer.tsx": "Displays a site footer with copyright, YouTube link, and donation info.",
  "frontend/src/components/GalleryLightbox.tsx": "Empty placeholder file for a gallery lightbox component.",
  "frontend/src/components/GallerySection.tsx": "Empty placeholder file for a gallery section component.",
  "frontend/src/components/HeroSection.tsx": "Renders the hero banner with background image, title, tagline, and scroll-navigation buttons.",
  "frontend/src/components/IntroSection.tsx": "Shows an intro video (embed or direct), a fallback link, and a synopsis excerpt with tagline.",
  "frontend/src/components/RewardsSection.tsx": "Displays a donations section promoting Cash App support.",
  "frontend/src/components/SectionHeader.tsx": "Provides a styled section header component with a title and accent underline.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with scroll detection, smooth section scrolling, and mobile menu toggle.",
  "frontend/src/components/VideoSection.tsx": "Video player section that switches source based on selected episode and shows fallback options on load errors.",
  "frontend/src/components/WorldbuildingSection.tsx": "Displays worldbuilding info from config including clans, eye rules, power system, rank system, and Shiranagi family.",
  "frontend/src/content/animeSiteConfig.ts": "Central config containing site metadata, video settings, donation tiers, and worldbuilding data.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for contact requests, admin checks, and admin role management.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theme variables for light/dark manga-inspired styling, along with global typography and scrollbar styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/normalizeIntroEmbedUrl.ts": "Converts YouTube and Vimeo URLs to embeddable formats and returns direct video file URLs unchanged.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a given element ID with an adjustable offset.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL/hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors based on CSS variables, extended utilities, animations, and plugins.",
  "project_state.json": "Stores project state, describing required features for adding a Clans section with lore and sigil images."
}