{
  "backend/main.mo": "Motoko backend providing access-controlled user profiles and contact request handling with admin-only export and topic filtering.",
  "feature_evidence.json": "JSON report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing short summaries for each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables and dark mode rules.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/RUN-LOCAL-AND-DEPLOY-IC.md": "Guide explaining how to run the site locally and deploy it to the Internet Computer.",
  "frontend/src/App.tsx": "Main React app composing all page sections, navigation, footer, and query client setup.",
  "frontend/src/components/AboutSection.tsx": "Displays the series synopsis using content from the site config.",
  "frontend/src/components/AdminSection.tsx": "Admin dashboard for login, viewing and exporting contact requests, updating request status, and granting admin roles.",
  "frontend/src/components/CharactersSection.tsx": "Renders character cards with metadata, optional images, and special-case logic disabling one character’s portrait.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation, mutation submission, error handling, and UI inputs for email, topic, and message.",
  "frontend/src/components/EpisodesSection.tsx": "Lists episodes from config and triggers episode selection plus scroll to video when clicked.",
  "frontend/src/components/Footer.tsx": "Static footer with copyright, YouTube link, and Cash App donation tag.",
  "frontend/src/components/GalleryLightbox.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/GallerySection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with background image, site title, CTA buttons, and smooth scrolling to sections.",
  "frontend/src/components/IntroSection.tsx": "Intro section showing an embedded or direct‑video intro, fallback link, tagline, and synopsis excerpt.",
  "frontend/src/components/RewardsSection.tsx": "Donation section displaying Cash App info and thank‑you message.",
  "frontend/src/components/SectionHeader.tsx": "Reusable section header component displaying a title with an accent underline.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with scroll detection, smooth section navigation, and mobile menu.",
  "frontend/src/components/VideoSection.tsx": "Video player section that loads selected episodes or default video with error handling and fallback link.",
  "frontend/src/components/WorldbuildingSection.tsx": "Renders the worldbuilding section, displaying clans, clan eye rules, power system, rank system, and Shiranagi family info using data from animeSiteConfig.",
  "frontend/src/content/animeSiteConfig.ts": "Defines site configuration including title, media URLs, reward tiers, and extensive worldbuilding data for clans, powers, ranks, and characters.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting, fetching, updating, and administering contact requests via the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind styles, fonts, color variables, dark mode themes, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and Internet Identity providers.",
  "frontend/src/utils/normalizeIntroEmbedUrl.ts": "Converts various video URLs into embeddable formats for YouTube or Vimeo, leaving direct video files unchanged.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls the page to a specified section with an adjustable offset.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores metadata about the project, including features, requests, and configuration state."
}