{
  "kind": "build_request",
  "title": "Update hero background artwork (moon + waterfall + volcano + sun)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Generate a new hero background image depicting a moon scene with a waterfall on one side and a volcano with the sun on the other side, and add it as a static asset under frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "now change backround",
          "of the moon and a waterfall on one side and a volcano with the sun on the other side"
        ]
      },
      "acceptanceCriteria": [
        "A new image file exists in frontend/public/assets/generated with the exact filename specified in imageRequirements.required.",
        "The image visually includes: (1) moon-themed side with a waterfall, (2) opposite side with a volcano and the sun."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Update the Hero section to use the newly generated background image instead of the current /assets/generated/anime-hero-bg.dim_1920x1080.png background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "now change backround",
          "of the moon and a waterfall on one side and a volcano with the sun on the other side"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/HeroSection.tsx references the new generated image path in its backgroundImage style.",
        "The hero remains full-screen with the background covering the section (no tiling) and the text remains readable with the existing overlay."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend.immutablePaths (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/components/ui).",
    "Do not route or fetch the hero background image through the backend; it must be served as a static asset from frontend/public/assets/generated."
  ],
  "nonGoals": [
    "Do not add email sending or real contact-message delivery functionality.",
    "Do not change unrelated page sections (About, Characters, Worldbuilding, Episodes, Contact, Footer) beyond any necessary styling side-effects from the new hero background."
  ],
  "imageRequirements": {
    "required": [
      "Epic anime-style landscape background with a moonlit waterfall scene on one side and a volcano with a bright sun on the other, blended into a single panoramic composition (anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png)"
    ],
    "edits": []
  }
}