{
  "kind": "build_request",
  "title": "Remove Sensei Kuroshi Shirogane’s age from character content and UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the character data in `frontend/src/content/animeSiteConfig.ts` so that Kuroshi Shirogane (Sensei) does not have an age value (remove the `age: 13` entry entirely or set it to a missing/undefined value that will not render). Do not replace it with another age or with the word \"Unknown\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "for the sensei don't make his age 13 just don't say anything for age"
        ]
      },
      "acceptanceCriteria": [
        "In `animeSiteConfig.characters`, Kuroshi Shirogane no longer has `age: 13` and no age text is provided for him."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Characters section UI (`frontend/src/components/CharactersSection.tsx`) so that the age label/value is only shown when a character has a valid age value. If a character has no age value, the rendered metadata line must omit the entire age portion (including the word \"Age\" and its separator dot) while keeping the rest of the metadata (clan, height, rank) intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "just don't say anything for age"
        ]
      },
      "acceptanceCriteria": [
        "Kuroshi Shirogane’s card does not display any age text (no \"Age\", no number, no placeholder).",
        "Other characters with an age value continue to display age as before.",
        "The metadata line formatting does not show extra separators (e.g., no double bullets) when age is omitted."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not modify files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change any backend (Motoko) code or contact/admin features.",
    "Do not add new character fields or new UI sections beyond conditionally hiding the age display."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}