{
  "kind": "build_request",
  "title": "Rename Rewards section to Donations and show Cash App donation text",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update the existing Rewards section UI to display the provided Cash App donation message content in the section body.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "🔥\nDonate Via Cash App\nSend support to:\n$WOTWM\nThank you for your support! 💙 ( put that in rewards section and rename the rewards section to donations"
        ]
      },
      "acceptanceCriteria": [
        "The section body includes the lines: \"Donate Via Cash App\", \"Send support to:\", \"$WOTWM\", and \"Thank you for your support!\" (including the 🔥 and 💙 emojis as provided).",
        "The donation content is rendered in the existing section area currently occupied by the Rewards tiers."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Rename the existing \"Rewards\" section to \"Donations\" across the UI, including the section header and the TopNav navigation link, and ensure the TopNav link scrolls to the renamed section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "rename the rewards section to donations"
        ]
      },
      "acceptanceCriteria": [
        "The section header displays \"Donations\" instead of \"Rewards\".",
        "Top navigation displays \"Donations\" instead of \"Rewards\".",
        "Clicking the \"Donations\" TopNav item scrolls to the Donations section reliably on desktop and mobile."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only).",
    "Do not edit any files listed in frontend.immutablePaths in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing payment processing, checkout flows, or verifying donations.",
    "Backend changes (no Motoko canister updates required)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}