{
  "kind": "build_request",
  "title": "Revert hero background to the previous background artwork",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Revert the public site hero section background image to the exact background artwork that was used immediately before the current image (/assets/generated/anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png). Update the hero so it no longer uses the current background image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "no I want the other background the one u had before this one"
        ]
      },
      "acceptanceCriteria": [
        "The Hero section (frontend/src/components/HeroSection.tsx) no longer references /assets/generated/anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png as its background image.",
        "When loading the site, the visible hero background matches the previously-used background artwork (the one used before the most recent background change).",
        "No other sections (About, Characters, Worldbuilding, Episodes, Contact, Admin, Footer) have visual or functional regressions."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If the previously-used hero background image file is not present in the repository under frontend/public/assets (or frontend/public/assets/generated), restore it (re-add the prior asset) and ensure it is served as a static frontend asset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-3"
        ],
        "quotes": [
          "do u remember the background before this new one?",
          "no I want the other background the one u had before this one"
        ]
      },
      "acceptanceCriteria": [
        "The previously-used background image file exists in the frontend static assets and loads without 404s in the browser network tab.",
        "The Hero section uses the restored prior background asset path."
      ]
    }
  ],
  "constraints": [
    "Do not change any backend canister logic; this request is limited to the site background/asset selection.",
    "Do not edit files in frontend/immutablePaths (compose using existing components/hooks instead)."
  ],
  "nonGoals": [
    "Do not create a new background design or change the art direction; the goal is to restore the exact previously-used background.",
    "Do not add a UI toggle/setting to switch backgrounds unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}