{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore prior hero background artwork",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Revert the Hero section background image to the previously-used artwork and remove usage of the current background image.",
      "acceptanceCriteria": [
        "The Hero section (frontend/src/components/HeroSection.tsx) no longer references /assets/generated/anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png as its background image.",
        "When loading the site, the visible hero background matches the previously-used background artwork (the one used before the most recent background change).",
        "No other sections (About, Characters, Worldbuilding, Episodes, Contact, Admin, Footer) have visual or functional regressions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Update the hero section inline backgroundImage to use the previously-used hero background artwork (switch away from /assets/generated/anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png and restore the prior path, expected to be /assets/generated/anime-hero-bg.dim_1920x1080.png)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the previously-used hero background image file exists in frontend static assets and is served without 404s.",
      "acceptanceCriteria": [
        "The previously-used background image file exists in the frontend static assets and loads without 404s in the browser network tab.",
        "The Hero section uses the restored prior background asset path."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/anime-hero-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Restore (re-add) the previously-used hero background artwork file as a static asset at this exact path if it is missing from the repository, so it can be served by the frontend without 404s."
        }
      ]
    }
  ]
}