{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Whispers of the White Moon is a content-driven, anime-themed single-page website built with a React + TypeScript frontend (Vite-style entry) and Tailwind CSS. The page is composed of sections (Hero, About, Characters, Worldbuilding, Episodes, Contact, Footer) whose text and structured lore are sourced from a single central configuration module (animeSiteConfig). The repository also includes an Internet Computer (ICP) Motoko backend canister scaffold (currently empty) and optional Internet Identity authentication plus a React Query-based actor creation hook to prepare for future authenticated backend calls. The previous Gallery section/navigation has been removed from the rendered layout and configuration, leaving empty placeholder files for the removed components.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "ICP Motoko backend canister scaffold",
      "synonyms": [
        "Motoko canister",
        "ICP backend scaffold"
      ],
      "description": "Includes a backend canister entrypoint (backend/main.mo) suitable for ICP deployment; currently implemented as an empty actor placeholder.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "React + TypeScript frontend application scaffold",
      "synonyms": [
        "React SPA",
        "Frontend bootstrap"
      ],
      "description": "A React + TypeScript frontend mounted from frontend/index.html via src/main.tsx and rendering the SPA root component (App).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "React Query provider setup",
      "synonyms": [
        "@tanstack/react-query setup",
        "QueryClientProvider"
      ],
      "description": "Creates a QueryClient in src/main.tsx and provides it to the app for cached async data and ICP actor creation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Tailwind CSS design system with OKLCH theme tokens",
      "synonyms": [
        "Tailwind theming",
        "Manga/ink-on-paper theme"
      ],
      "description": "Tailwind configured with CSS-variable OKLCH tokens (light/dark), custom fonts (Inter + Noto Serif JP), custom scrollbar styling, and plugins (typography, container-queries, animate).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Centralized site content configuration (animeSiteConfig)",
      "synonyms": [
        "Content-driven configuration",
        "Single source of truth for content"
      ],
      "description": "All user-facing content (title, tagline, synopsis, CTAs, worldbuilding data, character profiles, episodes) is centralized in frontend/src/content/animeSiteConfig.ts and rendered by UI components.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Single-page layout composing site sections (Gallery removed)",
      "synonyms": [
        "Landing page composition",
        "Section-based SPA"
      ],
      "description": "App.tsx composes TopNav plus Hero, About, Characters, Worldbuilding, Episodes, Contact, and Footer into a single scrolling page; no Gallery section is rendered.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Responsive top navigation with smooth scrolling and mobile menu",
      "synonyms": [
        "TopNav",
        "Anchor navigation"
      ],
      "description": "Fixed header navigation with scroll-aware styling, desktop links, mobile menu toggle, and smooth scrolling to section IDs with a header offset; links include Home, About, Characters, Worldbuilding, Episodes, and Contact.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Hero section with background image, CTAs, and scroll indicator",
      "synonyms": [
        "Hero banner",
        "Landing hero"
      ],
      "description": "Full-screen hero with background image overlay, title/tagline from config, primary/secondary CTA buttons that scroll to sections, and a bouncing scroll indicator button.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "About section rendering synopsis text",
      "synonyms": [
        "Synopsis section",
        "About the series"
      ],
      "description": "About section displays the multi-paragraph synopsis from config with readable typography and preserved line breaks (whitespace-pre-line).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Characters section (config-driven character cards)",
      "synonyms": [
        "Character roster",
        "Character profile cards"
      ],
      "description": "Renders a responsive grid of character cards from config, displaying clan, age, height, rank, design notes, bio, optional weapon, and current power state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Worldbuilding section (lore subsections)",
      "synonyms": [
        "Lore section",
        "Worldbuilding content"
      ],
      "description": "Displays structured lore from config including clans and eyes, clan-eye activation rules, power system rules, rank system (with starting ranks), Shiranagi family lore, and Moon Rock travel mechanic.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Episodes section (config-driven episode list)",
      "synonyms": [
        "Episode list",
        "Episode cards"
      ],
      "description": "Renders episodes from config in styled cards showing episode number, title, and synopsis (currently Episodes 1–2).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Contact section placeholder UI (non-functional)",
      "synonyms": [
        "Contact form UI",
        "Coming soon contact"
      ],
      "description": "Displays a styled contact form with disabled inputs and a visible “coming soon” notice; not connected to any backend/service.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Footer with attribution and social links",
      "synonyms": [
        "Site footer",
        "Outbound social links"
      ],
      "description": "Footer shows copyright, caffeine.ai attribution, and links/icons for X (Twitter) and GitHub.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Reusable section header component",
      "synonyms": [
        "SectionHeader",
        "Section title header"
      ],
      "description": "Provides consistent section title styling with a centered heading and accent underline used across page sections.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Internet Identity authentication context/provider",
      "synonyms": [
        "II auth",
        "InternetIdentityProvider"
      ],
      "description": "React context/provider using Dfinity AuthClient to load persisted identities, perform login/logout, expose identity and login status flags, and configure derivation origin via loaded config.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Backend actor creation hook (authenticated/anonymous)",
      "synonyms": [
        "useActor",
        "Actor factory hook"
      ],
      "description": "Creates and caches an ICP canister actor via React Query, selecting anonymous vs authenticated agent options based on current Internet Identity; invalidates/refetches other queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Gallery removed from layout and navigation",
      "synonyms": [
        "Remove Gallery section",
        "Remove Gallery nav link"
      ],
      "description": "The Gallery section is no longer rendered in App.tsx and the Gallery link is removed from TopNav so users cannot navigate to a gallery anchor.",
      "reqIds": [
        "REQ-7",
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Gallery code/config references removed",
      "synonyms": [
        "Remove galleryImages config",
        "Remove GallerySection/GalleryLightbox references"
      ],
      "description": "Gallery-related configuration and references have been removed so there are no remaining imports/references to GallerySection, GalleryLightbox, or animeSiteConfig.galleryImages (gallery component files remain as empty placeholders).",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-generate-a-new-hero-background-image-depicting-a-moon-scene-with-a-waterfall-on-one-side-and-a-volcano-with-the-sun-on-the-other-side-and-add-it-as-a-static-asset-under-frontend-public-assets-generated",
      "title": "Generate a new hero background image depicting a moon scene with a waterfall on one side and a volcano with the sun on the other side, and add it as a static asset under frontend/public/assets/generated.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-hero-section-to-use-the-newly-generated-background-image-instead-of-the-current-assets-generated-anime-hero-bg-dim-1920x1080-png-background",
      "title": "Update the Hero section to use the newly generated background image instead of the current /assets/generated/anime-hero-bg.dim_1920x1080.png background.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update hero/background artwork to depict a moon scene with a waterfall on one side and a volcano with the sun on the other side.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update Characters section content to use: Kazeyori Shiranagi (main), Sankei Enshiro, Haruna Hishigawa, and Aurelian (plus any related worldbuilding/episode details provided by the user).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Update Contact section to list contacts (Amir Abdullah, Abdullah Nurudeen) and emails (jamesaturservice45@gmail.com, abdullahnurudeen321@gmail.com) and allow visitors to submit questions (contact/questions form).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Update branding/site name: set top-left logo text to “Whispers of the White Moon” and set the intended domain/website name to “Whispersofthewhitemoon.com”.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Remove Gallery feature entirely (including deleting leftover empty placeholder GallerySection/GalleryLightbox files if still present) so there is no gallery UI or code confusion.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architecturalNotes": [
    "React + TypeScript SPA with a single-page, section-based layout composed in App.tsx.",
    "Content/config-driven architecture: user-facing copy and structured data (worldbuilding, characters, episodes, CTAs) centralized in frontend/src/content/animeSiteConfig.ts and consumed by section components.",
    "Tailwind CSS theming via OKLCH CSS variables (light/dark tokens) with custom typography (Google Fonts) and additional Tailwind plugins (typography, container-queries, animate).",
    "Navigation uses section IDs plus programmatic smooth scrolling with a fixed-header offset (implemented in TopNav and Hero CTAs).",
    "ICP integration scaffold: InternetIdentityProvider wraps the app and manages persisted identities; useActor creates/caches an anonymous or authenticated canister actor using React Query.",
    "Static assets (hero background, wordmark logo) are referenced via public paths under /assets/generated/."
  ],
  "knownIssues": [
    "backend/main.mo defines an empty actor with no methods; the frontend has ICP scaffolding but nothing to call.",
    "frontend/src/hooks/useQueries.ts is intentionally empty; there are no typed React Query hooks for backend methods.",
    "frontend/src/components/GallerySection.tsx and frontend/src/components/GalleryLightbox.tsx are empty placeholder files; if not referenced anywhere, they should be deleted to avoid confusion.",
    "Duplicate global CSS files exist (frontend/src/index.css and frontend/index.css). The app imports src/index.css; the extra file can confuse maintenance and theming.",
    "InternetIdentityProvider sets loginStatus to 'idle' in a finally block even after setting 'loginError' in the catch path, potentially masking initialization errors in UI state.",
    "DEFAULT_IDENTITY_PROVIDER is read from process.env.II_URL; if unset, login may fail without clear guidance.",
    "frontend/RUN-LOCAL-AND-DEPLOY-IC.md appears truncated (ends after the 'Install Dependencies' step), so run/deploy instructions are incomplete in this snapshot."
  ],
  "isFixRequest": false,
  "imageRequirements": "## Required Images\n- Epic anime-style landscape background with a moonlit waterfall scene on one side and a volcano with a bright sun on the other, blended into a single panoramic composition (anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png)",
  "generatedImages": [
    {
      "filename": "anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png",
      "description": "Epic anime-style landscape background with a moonlit waterfall scene on one side and a volcano with a bright sun on the other, blended into a single panoramic composition",
      "targetWidth": 1920,
      "targetHeight": 1080
    }
  ],
  "gameProjectType": "none",
  "projectName": "Whispers of the White Moon",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}