{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Whispers of the White Moon is an anime-themed React + TypeScript single-page website styled with Tailwind (OKLCH design tokens). The public site presents story content (Hero, About, Characters, Worldbuilding, Episodes) and a working Contact form that submits topic-tagged messages to an Internet Computer (ICP) Motoko canister. An Admin Dashboard section supports Internet Identity authentication and—when authorized—allows admins to view all contact requests, refresh the list, toggle each request’s processed status, and export requests as a JSON download. Backend authorization is implemented via a token-bootstrapped role-based access-control module and mixin.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "React + TypeScript single-page site composition",
      "synonyms": [
        "React SPA",
        "Frontend scaffold"
      ],
      "description": "Renders a single-page layout with TopNav, multiple anchored content sections, and a footer, all assembled in the root App component.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Tailwind CSS theming with OKLCH design tokens",
      "synonyms": [
        "Design tokens",
        "OKLCH theme"
      ],
      "description": "Defines light/dark theme tokens via CSS variables (OKLCH) and maps them into Tailwind for consistent colors, typography, radii, and effects across the site.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Config-driven site content (animeSiteConfig)",
      "synonyms": [
        "Content configuration",
        "Single source of truth"
      ],
      "description": "Centralizes title, tagline, synopsis, worldbuilding data, characters, and episodes in a single configuration object and renders sections from this data.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Fixed navigation with responsive mobile menu and smooth scrolling",
      "synonyms": [
        "Top navigation",
        "Anchor navigation"
      ],
      "description": "Implements a sticky TopNav with scroll-aware styling, a mobile hamburger menu, and smooth scrolling to section IDs with a header offset.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Hero section with background artwork and CTAs",
      "synonyms": [
        "Landing hero",
        "Hero banner"
      ],
      "description": "Displays a full-screen hero with a background image overlay, config-driven title/tagline, CTA buttons that scroll to site sections, and a scroll indicator control.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "About section (synopsis rendering)",
      "synonyms": [
        "Synopsis section"
      ],
      "description": "Renders the multi-paragraph anime synopsis from configuration with readable typography and preserved line breaks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Characters section (character cards)",
      "synonyms": [
        "Character roster",
        "Character profiles"
      ],
      "description": "Shows a responsive grid of character cards sourced from config, including stats (clan/age/height/rank), design notes, bio, weapon (optional), and power state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Worldbuilding section (lore subsections)",
      "synonyms": [
        "Lore section"
      ],
      "description": "Displays structured worldbuilding content from config, including clans, clan-eye rules, power system, rank system, Shiranagi family details, and Moon Rock mechanic.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Episodes section (episode list)",
      "synonyms": [
        "Episode cards",
        "Episode list"
      ],
      "description": "Renders a list of episodes from configuration with episode number, title, and synopsis in styled cards.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Footer with external social links",
      "synonyms": [
        "Site footer"
      ],
      "description": "Displays a footer with copyright year and outbound links (Twitter/X and GitHub).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Toast notifications for user feedback",
      "synonyms": [
        "Sonner toasts",
        "UI notifications"
      ],
      "description": "Uses sonner to show success/error/info notifications for contact submissions and admin actions (e.g., login failure, export success).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Motoko canister for contact request storage",
      "synonyms": [
        "ICP backend",
        "Contact request canister"
      ],
      "description": "Implements submitRequest to store contact requests (id, email, message, topic, timestamp, processed) in a Motoko Map with incrementing string IDs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Backend validation for contact submissions",
      "synonyms": [
        "Server-side validation"
      ],
      "description": "Validates contact submissions in the canister: email must be non-empty; message length must be 10–1000 characters; traps on invalid input.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Admin-only contact request management APIs (backend)",
      "synonyms": [
        "Admin queries",
        "Request moderation APIs"
      ],
      "description": "Provides admin-restricted canister methods to list all requests, filter by topic, filter by processed status, and update the processed flag by request ID.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Token-bootstrapped role-based access control (Motoko)",
      "synonyms": [
        "Authorization",
        "RBAC",
        "AccessControl"
      ],
      "description": "Implements user roles (admin/user/guest) and admin checks; first eligible principal to initialize with a matching secret can become admin; supports admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Authorization mixin exposing access-control methods",
      "synonyms": [
        "MixinAuthorization"
      ],
      "description": "Exposes canister methods for access-control initialization with secret, role lookup, role assignment, and is-admin checks by including a Motoko mixin.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Internet Identity authentication provider (frontend)",
      "synonyms": [
        "II auth",
        "AuthClient context"
      ],
      "description": "Provides a React context wrapping @dfinity/auth-client to load persisted identity, perform login/logout, and expose login status flags and errors.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Backend actor creation hook with authenticated/anonymous modes",
      "synonyms": [
        "useActor",
        "Actor factory"
      ],
      "description": "Creates an anonymous actor when unauthenticated and an identity-backed actor when logged in; on authenticated creation it calls _initializeAccessControlWithSecret using a secret from URL hash/session; invalidates and refetches dependent React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "URL parameter and secret handling utilities",
      "synonyms": [
        "Hash secret parsing",
        "Session persistence utilities"
      ],
      "description": "Utilities to read URL params from query/hash, persist values in sessionStorage, extract secrets from the hash fragment, and clear sensitive hash params from the address bar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "React Query hooks for contact request submission and admin operations",
      "synonyms": [
        "useSubmitContactRequest",
        "useGetAllRequests",
        "useUpdateRequestStatus"
      ],
      "description": "Defines typed React Query mutations/queries that call canister actor methods to submit requests, fetch all requests (admin), and update processed status, with contactRequests cache invalidation on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Functional contact form (frontend)",
      "synonyms": [
        "ContactSection",
        "Contact submission UI"
      ],
      "description": "Implements a validated contact form (email, topic, message) with client-side checks, disabled/loading states during submission, and toast feedback; submits to the canister via React Query.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Admin dashboard (frontend) with request table, status toggling, refresh, and JSON export",
      "synonyms": [
        "AdminSection",
        "Admin view"
      ],
      "description": "Gates admin UI behind Internet Identity authentication; fetches and displays contact requests in a table; supports refresh, toggling processed/new status, and exporting all requests as a downloaded JSON file.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Shared section header component",
      "synonyms": [
        "SectionHeader"
      ],
      "description": "Provides a reusable section title/header component with consistent typography and an accent underline used across site sections.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-revert-the-public-site-hero-section-background-image-to-the-exact-background-artwork-that-was-used-immediately-before-the-current-image-assets-generated-anime-hero-bg-moon-waterfall-volcano-sun-dim-1920x1080-png-update-the-hero-so-it-no-longer-uses-the-current-background-image",
      "title": "Revert the public site hero section background image to the exact background artwork that was used immediately before the current image (/assets/generated/anime-hero-bg-moon-waterfall-volcano-sun.dim_1920x1080.png). Update the hero so it no longer uses the current background image.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove Gallery section/feature from the public site UI",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update site branding: remove the top-left wordmark/PNG logo entirely and remove the “Made with Caffeine” attribution",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Update site-wide background artwork/style to a split scene: moon + waterfall on one side and volcano + sun on the other",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Update Characters content to: Kazeyori Shiranagi (main), Sankei Enshiro, Haruna Hishigawa, Aurelian (and remove others)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Update Contact section details: contacts Amir Abdullah and Abdullah Nurudeen; emails jamesaturservice45@gmail.com and abdullahnurudeen321@gmail.com; allow visitors to ask questions via a form",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add/ensure an admin-only view for submitted contact/questions messages, restricted to the owner’s Internet Identity principal (not by email string)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Set the public site domain/subdomain to a human-readable slug (e.g., whispers-of-the-white-moon on the Caffeine domain) with no numeric suffix, if platform allows",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Generate a PNG image export of the current site background (same look as the website background)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Revert the site background to the previous background design (prior to the most recent background change)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "If the previously-used hero background image file is not present in the repository under frontend/public/assets (or frontend/public/assets/generated), restore it (re-add the prior asset) and ensure it is served as a static frontend asset.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "architecturalNotes": [
    "Frontend is a React SPA composed of section components rendered in a single page (TopNav + multiple anchor sections + Footer).",
    "Styling uses Tailwind CSS with OKLCH CSS-variable design tokens, plus shadcn/ui-style primitives (e.g., Button/Table/Badge) and icon libraries (lucide-react, react-icons).",
    "Server state and canister calls are managed with @tanstack/react-query using typed queries/mutations and cache invalidation on success.",
    "Authentication uses Internet Identity via @dfinity/auth-client, exposed through a React context/provider (login/logout + identity persistence).",
    "ICP integration uses an actor factory created through a dedicated hook (useActor) that switches between anonymous and authenticated actors.",
    "Backend uses a Motoko access-control module (RBAC) included via a mixin, with admin bootstrapping based on a secret compared against an environment token.",
    "Admin access should be restricted by Internet Identity principal (caller) rather than by checking an email string."
  ],
  "knownIssues": [
    "Duplicate React Query providers: frontend/src/main.tsx wraps <App/> in QueryClientProvider, and frontend/src/App.tsx wraps again with a different QueryClient, causing nested providers and split caches.",
    "Two Tailwind CSS entry files exist (frontend/index.css and frontend/src/index.css). The app imports src/index.css; the extra root-level file can cause confusion or styling divergence.",
    "frontend/RUN-LOCAL-AND-DEPLOY-IC.md is truncated/incomplete (stops mid-instructions).",
    "frontend/src/components/GallerySection.tsx and frontend/src/components/GalleryLightbox.tsx are empty placeholder files (no implementation).",
    "Internet Identity provider URL is read from process.env.II_URL; in Vite-style builds this may be undefined unless explicitly injected (typically via import.meta.env).",
    "Backend contactRequests Map and nextRequestId are not stored in stable memory; data will not survive canister upgrades despite the “Persistent Storage” comment.",
    "AccessControl.getUserRole traps for unregistered principals; since isAdmin() calls getUserRole(), admin checks can trap unexpectedly unless initialize() has been called for the principal.",
    "MixinAuthorization._initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, potentially blocking authenticated admin usage entirely.",
    "AdminSection treats any error from getAllRequests as “Access Denied”, which can mislabel network/configuration/runtime failures as authorization failures.",
    "Exported request ordering is non-deterministic because Map.values() iteration order is not guaranteed.",
    "PNG background export is generating a blank/white image instead of matching the site background."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Whispers of the White Moon",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}