{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Whispers of the White Moon is an anime-themed React + TypeScript single-page marketing/story site styled with Tailwind CSS. The site renders multiple anchored sections (Hero, About, Characters, Worldbuilding, Episodes, Contact, Admin) driven by a central content configuration. Visitors can submit topic-tagged contact requests to an Internet Computer (ICP) Motoko canister. An admin dashboard uses Internet Identity authentication and token-bootstrapped role-based access control on the canister to allow authorized admins to view all contact requests, toggle a request’s processed status, refresh data, and export requests as a JSON file.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "React + TypeScript single-page anchored section layout",
      "synonyms": [
        "React SPA",
        "Section-based landing page"
      ],
      "description": "Renders a single-page site composed of anchored sections (Hero, About, Characters, Worldbuilding, Episodes, Contact, Admin) intended to be navigated via smooth scrolling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Tailwind CSS theming with OKLCH tokens, typography, and dark mode",
      "synonyms": [
        "Design tokens",
        "OKLCH theme",
        "Tailwind theming"
      ],
      "description": "Defines light/dark color tokens via CSS variables (OKLCH), custom fonts (Inter + Noto Serif JP), global heading typography, smooth scrolling, and custom scrollbar styling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Config-driven site content (animeSiteConfig)",
      "synonyms": [
        "Content configuration",
        "Static site config"
      ],
      "description": "Centralizes display content (title, tagline, synopsis, CTA labels, worldbuilding data, characters roster including Kuroshi Shirogane with rank 5 and Aurelian with rank \"Sunk King\", and episodes) into a single configuration object consumed by UI components.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Fixed top navigation with responsive menu and smooth-scroll offset",
      "synonyms": [
        "TopNav",
        "Anchor navigation",
        "Mobile menu"
      ],
      "description": "Implements a fixed header that changes appearance on scroll, includes a logo button to scroll to the hero section, provides desktop link buttons and a mobile menu toggle, and scrolls to anchors with a header offset.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Hero section with background artwork and CTA scroll controls",
      "synonyms": [
        "Landing hero",
        "Hero banner"
      ],
      "description": "Displays a full-screen hero with overlay gradient for readability, uses a configured background image, renders config-driven title/tagline, provides CTA buttons to scroll to key sections, and includes a bouncing scroll indicator.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "About section (synopsis rendering)",
      "synonyms": [
        "Synopsis section"
      ],
      "description": "Renders the multi-paragraph series synopsis from configuration with preserved line breaks and readable typography.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Characters section (config-driven character cards)",
      "synonyms": [
        "Character roster",
        "Character profiles"
      ],
      "description": "Displays a responsive grid of character cards sourced from configuration, showing name, clan, age, height, rank, design notes, bio, optional weapon, and power state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Worldbuilding section (structured lore subsections)",
      "synonyms": [
        "Lore section",
        "Worldbuilding"
      ],
      "description": "Displays structured worldbuilding content from configuration including clans, clan-eye rules, power system rules, rank system, Shiranagi family details, and the Moon Rock mechanic.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Episodes section (episode list)",
      "synonyms": [
        "Episode cards",
        "Episode list"
      ],
      "description": "Renders episode entries from configuration with episode number, title, and synopsis using styled cards.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Contact form with validation and topic selection",
      "synonyms": [
        "ContactSection",
        "Contact submission UI"
      ],
      "description": "Implements a contact form with email/topic/message inputs, client-side validation (email format and message length), disabled/loading UI during submission, character count feedback, and toast notifications; submits to the ICP canister.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Toast notifications for user feedback",
      "synonyms": [
        "Sonner toasts",
        "UI notifications"
      ],
      "description": "Uses Sonner to show success/error/info notifications for contact submission, login failures, export success, and request status updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Internet Identity authentication provider (frontend)",
      "synonyms": [
        "II auth",
        "AuthClient context"
      ],
      "description": "Wraps @dfinity/auth-client in a React context/provider to restore persisted identity, perform login/logout, and expose login status flags and errors to components.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Backend actor creation hook with authenticated/anonymous modes",
      "synonyms": [
        "useActor",
        "Actor factory hook"
      ],
      "description": "Creates an anonymous canister actor when unauthenticated and an identity-backed actor when logged in; on authenticated creation it calls _initializeAccessControlWithSecret with a secret token read from the URL hash/session, and invalidates/refetches non-actor react-query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "URL parameter and secret persistence utilities",
      "synonyms": [
        "Hash secret parsing",
        "Session persistence utilities"
      ],
      "description": "Implements helpers for extracting URL parameters (query and hash), persisting them in sessionStorage, retrieving secrets from the hash fragment, and attempting to clear sensitive parameters from the address bar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "React Query hooks for contact request submission and admin operations",
      "synonyms": [
        "useSubmitContactRequest",
        "useGetAllRequests",
        "useUpdateRequestStatus"
      ],
      "description": "Provides typed react-query mutations/queries that call canister actor methods to submit contact requests, fetch all requests (admin-only), and update processed status, with contactRequests cache invalidation on mutation success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Admin dashboard (authentication, request table, status toggling, refresh, export)",
      "synonyms": [
        "AdminSection",
        "Admin view"
      ],
      "description": "Provides an admin section gated by Internet Identity login; fetches and displays contact requests in a table; supports manual refresh, toggling processed/new status per request, and exporting all requests as a downloaded JSON file.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Motoko canister: contact request submission, validation, and storage",
      "synonyms": [
        "ICP backend",
        "Contact request canister"
      ],
      "description": "Implements submitRequest to validate and store contact requests (id, email, message, topic, timestamp, processed) in an in-memory Map keyed by incrementing string IDs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Motoko canister: admin-only request management APIs",
      "synonyms": [
        "Admin queries",
        "Request management APIs"
      ],
      "description": "Provides admin-restricted methods to get all requests, filter by topic, filter by processed status, and update a request’s processed flag by ID.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Token-bootstrapped RBAC and authorization mixin (Motoko)",
      "synonyms": [
        "Authorization",
        "RBAC",
        "AccessControl",
        "MixinAuthorization"
      ],
      "description": "Implements roles (admin/user/guest); first principal to initialize with the correct secret becomes admin, subsequent new principals become users, and admins can assign roles. Exposes initialization, role lookup, role assignment, and isAdmin checks via a Motoko mixin included into the main canister actor.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Footer with external social links",
      "synonyms": [
        "Site footer"
      ],
      "description": "Displays a footer with copyright year and external links/icons for Twitter/X and GitHub.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-character-data-in-frontend-src-content-animesiteconfig-ts-so-that-kuroshi-shirogane-sensei-does-not-have-an-age-value-remove-the-age-13-entry-entirely-or-set-it-to-a-missing-undefined-value-that-will-not-render-do-not-replace-it-with-another-age-or-with-the-word-unknown",
      "title": "Update the character data in `frontend/src/content/animeSiteConfig.ts` so that Kuroshi Shirogane (Sensei) does not have an age value (remove the `age: 13` entry entirely or set it to a missing/undefined value that will not render). Do not replace it with another age or with the word \"Unknown\".",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-characters-section-ui-frontend-src-components-characterssection-tsx-so-that-the-age-label-value-is-only-shown-when-a-character-has-a-valid-age-value-if-a-character-has-no-age-value-the-rendered-metadata-line-must-omit-the-entire-age-portion-including-the-word-age-and-its-separator-dot-while-keeping-the-rest-of-the-metadata-clan-height-rank-intact",
      "title": "Update the Characters section UI (`frontend/src/components/CharactersSection.tsx`) so that the age label/value is only shown when a character has a valid age value. If a character has no age value, the rendered metadata line must omit the entire age portion (including the word \"Age\" and its separator dot) while keeping the rest of the metadata (clan, height, rank) intact.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove/hide Sensei Kuroshi Shirogane's age field (do not display an age value)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a section-based React SPA using anchored sections and smooth scrolling with a fixed-header offset.",
    "Styling uses Tailwind CSS with CSS-variable OKLCH design tokens, light/dark mode support, and custom typography (Inter for body, Noto Serif JP for headings).",
    "Server-state and canister calls are managed with @tanstack/react-query via custom query/mutation hooks and cache invalidation on mutation success.",
    "Authentication uses Internet Identity via @dfinity/auth-client wrapped in a React context/provider that restores persisted identity and exposes login/logout and status flags.",
    "ICP integration is done through an actor factory; a custom hook (useActor) creates anonymous vs identity-backed actors and runs an access-control initialization call on authenticated actor creation.",
    "Backend is a Motoko canister that stores contact requests in an in-memory Map and restricts admin operations using an AccessControl module composed into the main actor via a Motoko mixin (MixinAuthorization)."
  ],
  "known_issues": [
    "Duplicate React Query QueryClientProvider usage: frontend/src/main.tsx and frontend/src/App.tsx each create and provide different QueryClients, which can split caches and make invalidation/refetch behavior inconsistent.",
    "Internet Identity provider URL is read from process.env.II_URL; in Vite/ESM builds this may be undefined unless explicitly injected (commonly via import.meta.env).",
    "Motoko state (contactRequests, nextRequestId, and access-control role map) is not stored in stable memory; all requests and roles will reset on canister upgrade despite the \"Persistent Storage\" comment.",
    "AccessControl.getUserRole traps for unregistered principals; because isAdmin() calls getUserRole(), admin-gated endpoints can trap with \"User is not registered\" if initialization hasn’t registered the caller yet.",
    "Admin bootstrapping is effectively one-shot per principal: if a principal is first registered as #user (e.g., wrong/missing token), later providing the correct token won’t promote them to #admin without an existing admin assigning the role.",
    "MixinAuthorization._initializeAccessControlWithSecret traps if the CAFFEINE_ADMIN_TOKEN environment variable is not set on the canister, breaking admin bootstrapping and any flow that expects initialization to succeed.",
    "URL secret clearing is incomplete for '#key=value' style hashes: getSecretFromHash parses such hashes, but clearParamFromHash only removes parameters when the hash contains a '?' query segment; the secret may remain in the address bar/history.",
    "AdminSection treats any error from getAllRequests as \"Access Denied\", which can misrepresent network/config/runtime failures as authorization failures.",
    "AdminSection awaits login() even though login() is not async and does not throw; the try/catch in handleAuth will not catch login failures delivered via AuthClient callbacks.",
    "frontend/src/components/GallerySection.tsx and frontend/src/components/GalleryLightbox.tsx exist but are empty in this snapshot; no gallery UI is implemented from these files.",
    "frontend/RUN-LOCAL-AND-DEPLOY-IC.md is truncated/incomplete in this snapshot.",
    "There are two global CSS files (frontend/src/index.css and frontend/index.css) with different token sets; only src/index.css is imported, but the extra file can cause confusion."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Whispers of the White Moon",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}